import { BookOpen, PenTool, Globe, Code, Brush, Camera, Film, Edit, FileText, Monitor, Shield, Edit3 } from "lucide-react";

export const Services = [
   {
      id: 1,
      icon: <BookOpen className="h-10 w-10 text-main-800" />,
      title: "كتابة الابحاث العلمية",
      description: "خدمة كتابة الأبحاث العلمية بجودة عالية",
      info: "نقدم خدمة كتابة الأبحاث العلمية بجودة عالية، حيث يعتمد فريقنا على منهجيات بحث دقيقة تضمن تقديم محتوى أصلي ومبتكر. نحن نركز على متطلبات البحث المختلفة ونقوم بتنسيق كل جزء من البحث بدقة، مما يساهم في تحقيق نتائج متميزة ورفع مستوى الأداء الأكاديمي للطلاب.",
      category: "Academic",
      image: "/images/ScientificResearchWriting.jpg"
   },
   {
      id: 2,
      icon: <PenTool className="h-10 w-10 text-green-600" />,
      title: "تنسيق الرسائل العلمية",
      description: "تنسيق احترافي للرسائل العلمية",
      info: "نقدم خدمات تنسيق احترافية للرسائل العلمية، حيث نعمل على التأكد من أن الرسالة مرتبة ومنظمة بشكل جيد مع الالتزام بالمعايير الأكاديمية. نحن نركز على كل تفاصيل التنسيق، بما في ذلك الهوامش، الخطوط، والمراجع، مما يجعلها جاهزة للتقديم للمؤسسات الأكاديمية.",
      category: "Academic",
      image: "/images/ThesisFormatting.jpg"
   },
   {
      id: 3,
      icon: <Edit3 className="h-10 w-10 text-red-600" />,
      title: "الماجستير والدكتوراه",
      description: "تقديم المساعدة في إعداد رسائل الماجستير والدكتوراه",
      info: "نقدم الدعم والمساعدة للطلاب في إعداد رسائل الماجستير والدكتوراه، حيث يوفر فريقنا المتخصص استشارات أكاديمية تتعلق بكتابة المحتوى وتقديم أفكار مبتكرة. نحن نساعدك في هيكلة الرسالة، وضمان تناسق المحتوى، مما يسهل عليك استكمال دراستك بنجاح.",
      category: "Academic",
      image: "/images/virtualgraduation.jpg"
   },
   {
      id: 4,
      icon: <Globe className="h-10 w-10 text-blue-600" />,
      title: "ترجمة الابحاث العلمية",
      description: "ترجمة دقيقة للأبحاث العلمية",
      info: "نقدم خدمات ترجمة دقيقة للأبحاث العلمية بمختلف اللغات. يتمتع مترجمونا بخبرة واسعة في المجال الأكاديمي، مما يضمن أن تعكس الترجمة المعاني الأصلية بدقة، وتساعدك على توسيع نطاق جمهورك الأكاديمي وتوفير وصول أوسع لمحتواك.",
      category: "Academic",
      image: "/images/scientificresearchtranslation.avif"
   },
   // Design and Branding Services
   {
      id: 5,
      icon: <Brush className="h-10 w-10 text-purple-600" />,
      title: "تصميم لوجو وهوية بصرية",
      description: "تصميم هوية بصرية مبتكرة ولوجو",
      info: "نساعدك في تصميم هوية بصرية مبتكرة ولوجو يعكس رؤيتك وقيمك. نحن نركز على خلق تصميم فريد وجذاب، حيث نفهم أهمية الهوية البصرية في تعزيز علامتك التجارية. تصميمنا يساعد في تمييزك في السوق ويجعل علامتك التجارية أكثر قابلية للتذكر.",
      category: "Design",
      image: "/images/logodesign.avif"
   },
   {
      id: 6,
      icon: <Camera className="h-10 w-10 text-yellow-600" />,
      title: "تصميم ومونتاج الفيديو",
      description: "تصميم ومونتاج فيديو احترافي",
      info: "نقدم خدمات تصميم ومونتاج فيديو احترافي يبرز رسالتك بأفضل طريقة. نستخدم تقنيات حديثة وأفكار مبتكرة لجعل محتواك المرئي مؤثرًا وجذابًا، مما يساعدك على التفاعل مع جمهورك بطريقة مميزة.",
      category: "Design",
      image: "/images/video-editing.avif"
   },
   {
      id: 7,
      icon: <Film className="h-10 w-10 text-pink-600" />,
      title: "الموشن جرافيك",
      description: "تصميم رسوم متحركة موشن جرافيك",
      info: "نقدم تصميم رسوم متحركة موشن جرافيك بأسلوب جذاب ومبتكر، حيث تساعد خدماتنا في جعل المحتوى الخاص بك أكثر تفاعلًا وإبداعًا. نركز على إنشاء محتوى مرئي يلفت الانتباه ويعزز الرسائل التي ترغب في توصيلها.",
      category: "Design",
      image: "/images/motion-graphic.jpg"
   },
   {
      id: 8,
      icon: <Edit className="h-10 w-10 text-teal-600" />,
      title: "كتابة بروفايل الشركات",
      description: "كتابة بروفايل شركات يعكس هويتك",
      info: "نساعدك في كتابة بروفايل شركات يعكس هويتك وقيمك، ويظهر خبراتك ومشاريعك بشكل جذاب. نهدف إلى تقديم محتوى يبرز تميزك في السوق ويساعدك على بناء ثقة مع عملائك المحتملين.",
      category: "Design",
      image: "/images/companyprofilewriting.jpg"
   },
   // Digital Services
   {
      id: 9,
      icon: <Monitor className="h-10 w-10 text-orange-600" />,
      title: "المواقع والتطبيقات",
      description: "إنشاء مواقع وتطبيقات متكاملة",
      info: "نقدم خدمات إنشاء مواقع وتطبيقات متكاملة لجميع المجالات، مع التركيز على تجربة المستخدم والتصميم الجذاب. نحن نعمل على تطوير حلول رقمية تلبي احتياجاتك الخاصة، ونساعد في تعزيز وجودك الرقمي.",
      category: "Digital",
      image: "/images/web-design.avif"
   },
   {
      id: 10,
      icon: <FileText className="h-10 w-10 text-gray-600" />,
      title: "كتابة الاعلانات والمقالات",
      description: "كتابة إعلانات ومقالات صحفية",
      info: "نقدم خدمات كتابة إعلانات ومقالات صحفية بجودة عالية، مع التركيز على الجوانب الإبداعية والجذابة. نساعدك على إيصال رسالتك بشكل فعال، وضمان أن تكون محتوياتك ملهمة وتحقق أهدافك التسويقية.",
      category: "Digital",
      image: "/images/creative-content.jpg"
   },
   {
      id: 11,
      icon: <Shield className="h-10 w-10 text-indigo-600" />,
      title: "التفريغ وإدخال البيانات",
      description: "خدمات تفريغ وإدخال البيانات",
      info: "نقدم خدمات تفريغ وإدخال البيانات بدقة عالية، مع الالتزام بالجودة والسرعة. نساعدك على تنظيم معلوماتك وتحليلها بطريقة فعالة، مما يسهل عليك اتخاذ القرارات المستندة إلى البيانات.",
      category: "Digital",
      image: "/images/data-entry.avif"
   },
   {
      id: 12,
      icon: <Edit3 className="h-10 w-10 text-cyan-600" />,
      title: "التصحيح والتدقيق اللغوي",
      description: "خدمات التدقيق اللغوي وتصحيح الأخطاء",
      info: "نقدم خدمات التدقيق اللغوي وتصحيح الأخطاء بدقة، حيث نعمل على ضمان أن يكون المحتوى الخاص بك خاليًا من الأخطاء وجاهزًا للنشر. نحن نهدف إلى رفع مستوى احترافية المحتوى الخاص بك وتحسين جودته.",
      category: "Digital",
      image: "/images/proofreadingandEditing.avif"
   },
];
